#include <iostream>
#include <cassert>

/*
 * СОРЕВНОВАНИЕ
 * 
 * Отсортировать массив целых чисел из задачи 7 за наименьшее время.
 * Сортировать массив обязательно полностью.
 * Разрешается использовать произвольный тип сортировки, в том числе тот,
 * который используется для решения седьмой задачи.
 * 
 * |  in                    |  out                      |
 * |------------------------+---------------------------|
 * |                        |                           |
 */

int main(int argc, char *argv[])
{

    using std::cin;
    using std::cout;
    

    return 0;
}
