#include <iostream>
#include <cassert>

/*
 * Дан массив целых чисел A[0..n). Массив произвольным образом заполнен натуральными числами из диапозона [0..n-1).
 * Одно или несколько значений в массиве может повторяться. Необходимо найти любой повтор за O(n), памяти O(1).
 * Исходный массив хранить можно, модифицировать нельзя.
 * N <= 10000.
 * 
 * |  in                    |  out                      |
 * |------------------------+---------------------------|
 * |  8                     |  1                        |
 * |  1 2 4 5 6 1 0 3       |                           |
 */

int main(int argc, char *argv[])
{

    using std::cin;
    using std::cout;
    

    return 0;
}
